1.

In [1]:
import pandas as pd

In [22]:
s = pd.Series([4,8,15,16,23] , index = [1,2,3,4,5])
s

1     4
2     8
3    15
4    16
5    23
dtype: int64

2

In [23]:
list_elem = ['Taher' , 'Pw' , 4,34, 453]

In [24]:
s1 = pd.Series(list_elem)
s1

0    Taher
1       Pw
2        4
3       34
4      453
dtype: object

3

In [25]:
data = {
    'Name' : ["Alice" , "Bob" , "Claire"] , 
        'Age' : [25 ,20, 27], 
        'Gender' : ["female" , "male" , "female"]}

In [26]:
s2 = pd.DataFrame(data)

In [27]:
s2

     Name  Age  Gender
0   Alice   25  female
1     Bob   20    male
2  Claire   27  female

4. A DataFrame in pandas is a 2-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns), whereas a Series is a 1-dimensional array with labels (like a single column of a DataFrame).

Example of Dataframe

In [28]:
data = {
    'Name' : ["Taher" , "Ali" , "Zainab"] , 
        'Age' : [25 ,20, 27], 
        'Gender' : ["Male" , "Male" , "Female"]
}

In [29]:
s3 = pd.DataFrame(data)

In [30]:
s3

     Name  Age  Gender
0   Taher   25    Male
1     Ali   20    Male
2  Zainab   27  Female

Example of Series

In [31]:
data = {
    'Name' : ["Taher" , "Ali" , "Zainab"] , 
        'Age' : [25 ,20, 27], 
        'Gender' : ["Male" , "Male" , "Female"]
}

In [32]:
s4 = pd.Series(data)

In [33]:
s4

Name      [Taher, Ali, Zainab]
Age               [25, 20, 27]
Gender    [Male, Male, Female]
dtype: object

5. Some common functions to manupulate data in Pandas DataFrame are head , info , describe , tail , merge.
Example of using tail function, This function fetch the last 5 records of the data

Example of using tail function, This function fetch the last 5 records of the data

In [34]:
s5 = pd.Series([15,223,335,434,54,62,76,56])

In [35]:
s5.tail()

3    434
4     54
5     62
6     76
7     56
dtype: int64

6 .Series and DataFrames are mutable

7. Creating a Dataframe by using multiple series

In [39]:
name_series = pd.Series(['Alice', 'Bob', 'Claire'])
age_series = pd.Series([25, 30, 27])
gender_series = pd.Series(['Female', 'Male', 'Female'])

df = pd.DataFrame({
    'Name': name_series,
    'Age': age_series,
    'Gender': gender_series
})

In [41]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female